Seeed-Studio/seeed-linux-dtoverlays/extras/hc32l13x_ddl_Rev1.9.2_Lite/mcu/EWARM/HC32L13X.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OPA</name>
            <description>desc OPA</description>
            <baseAddress>0x40002400</baseAddress>
            <alternatePeripheral>ADC</alternatePeripheral>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3D</size>
            </addressBlock>
            <registers>
                <register>
                    <name>CR0</name>
                    <description>desc CR0</description>
                    <addressOffset>0x30</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x120</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AZEN</name>
                            <description>desc AZEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UBUFSEL</name>
                            <description>desc UBUFSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESSEL</name>
                            <description>desc RESSEL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BIASSEL</name>
                            <description>desc BIASSEL</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NEGSEL</name>
                            <description>desc NEGSEL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POSSEL</name>
                            <description>desc POSSEL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGAGAIN</name>
                            <description>desc PGAGAIN</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POEN</name>
                            <description>desc POEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESINMUX</name>
                            <description>desc RESINMUX</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <description>desc CR1</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x120</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AZEN</name>
                            <description>desc AZEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UBUFSEL</name>
                            <description>desc UBUFSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESSEL</name>
                            <description>desc RESSEL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BIASSEL</name>
                            <description>desc BIASSEL</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NEGSEL</name>
                            <description>desc NEGSEL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POSSEL</name>
                            <description>desc POSSEL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGAGAIN</name>
                            <description>desc PGAGAIN</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POEN</name>
                            <description>desc POEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESINMUX</name>
                            <description>desc RESINMUX</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR2</name>
                    <description>desc CR2</description>
                    <addressOffset>0x38</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x120</resetValue>
                    <resetMask>0x3FFFF</resetMask>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>desc EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AZEN</name>
                            <description>desc AZEN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>desc MODE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UBUFSEL</name>
                            <description>desc UBUFSEL</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESSEL</name>
                            <description>desc RESSEL</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BIASSEL</name>
                            <description>desc BIASSEL</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NEGSEL</name>
                            <description>desc NEGSEL</description>
                            <msb>9</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POSSEL</name>
                            <description>desc POSSEL</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PGAGAIN</name>
                            <description>desc PGAGAIN</description>
                            <msb>14</msb>
                            <lsb>12</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POEN</name>
                            <description>desc POEN</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RESINMUX</name>
                            <description>desc RESINMUX</description>
                            <msb>17</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR</name>
                    <description>desc CR</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>ADCTR_EN</name>
                            <description>desc ADCTR_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIGGER</name>
                            <description>desc TRIGGER</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AZ_PULSE</name>
                            <description>desc AZ_PULSE</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SW_SET</name>
                            <description>desc CLK_SW_SET</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SEL</name>
                            <description>desc CLK_SEL</description>
                            <msb>7</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
